Autodesk.Revit.DB.Structure.AnalyticalNodeData.GetAnalyticalNodeData(Autodesk.Revit.DB.Element)
Returns AnalyticalNodeData associated with this element, if it exists.
Remarks:
If the input element doesn't have AnalyticalNodeData than it retuns null.
The input element should be a ReferencePoint.
element:
The element from which we try to obtain AnalyticalNodeData.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Structure.AnalyticalNodeData.GetConnectionStatus
Returns the Connection Status for this Analytical Node.
Since:
2021

Autodesk.Revit.DB.Structure.AnalyticalNodeData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.AnalyticalNodeData
This class holds information related to analytical model.
Remarks:
This class is attached to a ReferencePoint.
Since:
2021